# Напишите программу, которая проверит истинность утверждения ¬(X ⋁ Y) = ¬X ⋀ ¬Y
# (!(x_input && y_input) == !x_input || !y_input)

x = True
y = False

print(x)